/***********************/
/*****Te3Ka_PaynE*******/
/*Mnement4813@yandex.ru*/
/***********************/

/*
Напишите программу, которая принимает на вход цифру,
обозначающую день недели, и проверяет, является ли этот день выходным.
6 -> да
7 -> да
1 -> нет
*/

//Получение номера дня от пользователя
Console.WriteLine("Программа показывает, является ли введённый номер дня недели выходным днём.");
Console.Write("Введите номер дня недели от 1 до 7: ");
int numDay = Convert.ToInt32(Console.ReadLine());
