/***********************/
/*****Te3Ka_PaynE*******/
/*Mnement4813@yandex.ru*/
/***********************/

/*
Напишите программу, которая принимает на вход трёхзначное число и на выходе показывает вторую цифру этого числа.
456 -> 5
782 -> 8
918 -> 1
*/

//Введение числа от пользователя
Console.WriteLine("Программа показывает срединную (вторую) цифру введённого трёхзначного числа.");
Console.Write("Введите трёхзначное число: ");
int number = Convert.ToInt32(Console.ReadLine());

//Проверка на трёхзначность введённого числа
if ((Math.Abs(number) < 100) || (Math.Abs(number) > 999))
{
    Console.WriteLine("Введено не трёхзначное число! Выполнение программы прервано.");
    return;
}

int result = number / 10; // Убираем последнюю цифру, число становится двузначным.
result %= 10; // Убираем первую цифру. В переменной result остаётся искомая цифра

Console.WriteLine("Срединная цифра введённого трёхзначного числа = " + result);