/***********************/
/*****Te3Ka_PaynE*******/
/*Mnement4813@yandex.ru*/
/***********************/

/*
Напишите программу, которая выводит третью цифру заданного числа или сообщает, что третьей цифры нет.
645 -> 5
78 -> третьей цифры нет
32679 -> 6
*/

//Получение числа от пользователя.
Console.WriteLine("Введите любое число. Программа выведет третью цифру справа этого числа, если она есть.");
Console.Write("Введите число: ");
int number = Convert.ToInt32(Console.ReadLine());
